[
  {
    "name": "INTBOT '25 Project Presentation",
    "details": "Showcase your innovative IoT projects and compete for exciting prizes at the INTBOT '25 Project Presentation event. This event provides a platform for talented engineers and developers to present their cutting-edge IoT solutions and connect with industry experts.",
    "date": "February 7, 2025",
    "image": "project.jpg",
    "convener": "DR.K. RAJA",
    "facultyCoordinator": "Ms.M.Senha Priya",
    "studentCoordinator": "Logesh Kanna.T (9499927995)",
    "registrationFee": 100,
    "registrationLink": "intbot_2k25",
    "naacGrade": "A++",
    "venue": "SRM University, Ramapuram, Chennai",
    "teamSize": "1-3",
    "about": "Present your project in a dynamic and engaging manner, emphasizing its core objectives, unique solutions, and practical applications. This is your platform to showcase your innovation, technical expertise, and the value your project brings to the table. Communicate your ideas effectively and leave a strong impact on your audience!",
    "highlights": "Exciting cash prizes, networking with industry leaders, and the chance to showcase your work on a national platform.",
    "rules": [
      "Use professional slides and avoid excessive text or animations.",
      "Maintain professionalism during Q&A sessions and audience interactions.",
      "Test your presentation on venue equipment beforehand.",
      "Bring a backup of your materials (e.g., USB or cloud storage).",
      "Presentations will be judged on content quality, demo, delivery, visuals, time management, and Q&A performance.",
      "Arrive at least 30 minutes before your scheduled time. Late arrivals may forfeit their slot."
    ]
  },
  {
    "name": "Techno Connect",
    "details": "Techno Connect is a dynamic event that brings together technical minds from across the country. Explore the latest advancements in technology, engage in thought-provoking discussions, and connect with peers who share your passion for innovation.",
    "date": "February 7, 2025",
    "image": "techno connect.png",
    "convener": "DR.K. RAJA",
    "facultyCoordinator": "Dr.S.Revathi",
    "studentCoordinator": "Yamini (97512 91856)",
    "registrationFee": 100,
    "registrationLink": "intbot_2k25",
    "naacGrade": "A++",
    "venue": "SRM University, Ramapuram, Chennai",
    "teamSize": "1-3",
    "about": "Dive into Techno Connect, an exciting technical connection game that challenges your knowledge and creativity! Connect technical terms, concepts, and ideas to solve puzzles and outsmart your competitors. Test your expertise, think outside the box, and experience the thrill of connecting the dots in this innovative and engaging event!",
    "highlights": "Hands-on workshops, industry-led panel discussions, and opportunities to collaborate on innovative projects.",
    "rules": [
      "The event is open for the teams comprising 2-3 members, with prior registration being mandatory.",
      "It consists of multiple rounds where participants identify technical terms based on images.",
      "A strict time limit of 2–3 minutes is set for each question.",
      "Answers must be final and submitted within the given time limit. Points are awarded for correct answers.",
      "External help is strictly prohibited, and any cheating results in disqualification.",
      "Teams with low scores are eliminated at the end of each round.",
      "In the case of a tie, a special question is given, and the team with the fastest correct answer wins."
    ]
  },
  {
    "name": "WEBDEV BRACKETS",
    "details": "WEBDEV BRACKETS is a captivating event that celebrates the intersection of design and functionality in web development. Showcase your web development skills, learn from industry pioneers, and compete to create the most visually stunning and user-friendly websites.",
    "date": "February 7, 2025",
    "image": "web brackets.png",
    "convener": "DR.K. RAJA",
    "facultyCoordinator": "Dr.S.REVATHY",
    "studentCoordinator": "SHRIKRISHNA (9840238122)",
    "registrationFee": 100,
    "naacGrade": "A++",
    "registrationLink": "intbot_2k25",
    "venue": "SRM University, Ramapuram, Chennai",
    "teamSize": "1-3",
    "about": "An exciting competition where students are prompted to demonstrate their HTML and CSS prowess by replicating a given webpage within a specified timeframe. Participants are encouraged to unleash their creativity, crafting visually captivating and functional web designs showcasing their mastery of the front-end development.",
    "highlights": "Cash prizes for the best-designed and most functional websites, networking with industry leaders, and the opportunity to showcase your web development prowess.",
    "rules": [
      "Teams are required to clone the image or website using only HTML and CSS.",
      "Usage of generative AI tools during the event is prohibited, but internet access is allowed.",
      "Web Dev Bracket will be organized in a Bracket format.",
      "Cloned websites will be evaluated based on accuracy.",
      "Teams closest to the given task within the specified time limit will progress to the next round.",
      "It is mandatory for each team to have their own laptop with a fully charged battery.",
      "Any team that violates the above-mentioned rules would be disqualified."
    ]
  },
  {
    "name": "Intellect Summit",
    "details": "Intellect Summit is a prestigious event that celebrates the art of academic research and paper presentation. Aspiring scholars and researchers will have the opportunity to showcase their groundbreaking work, engage in thought-provoking discussions, and connect with a community of intellectuals.",
    "date": "February 7, 2025",
    "image": "intellect summit.png",
    "convener": "DR.K. RAJA",
    "facultyCoordinator": "Dr.J.Jospin JEYA",
    "studentCoordinator": "SURAJ (8520967667)",
    "registrationFee": 100,
    "registrationLink": "intbot_2k25",
    "venue": "SRM University, Ramapuram, Chennai",
    "teamSize": "2-3",
    "about": "The *Intellect Summit* is a paper presentation event where participants prepare and present a research paper on a specific topic or area to a jury. The presentations will be assessed based on the quality of the paper and the participants' delivery. Participants are also expected to summarize the key points of their presentation and offer recommendations for future research directions.",
    "highlights": "Cash prizes for the best research papers, networking with renowned academics, and the chance to publish your work in a reputable journal.",
    "rules": [
      "Team members should bring their own laptop for their presentation.",
      "Team members can copy their presentation to a pen drive.",
      "Word limit: 2500-3000 words.",
      "Font type: Times New Roman.",
      "Paper size: A4 size.",
      "Alignment: Left.",
      "First team members should submit the abstract.",
      "Each team member gives 10 minutes for their presentation.",
      "Team members may use visual aids such as slides or posters to enhance their presentation.",
      "Any team that violates the above-mentioned rules would be disqualified."
    ]
  },
  {
    "name": "Bits & Bytes",
    "details": "The Ultimate Tech Quiz Challenge  Unleash your inner tech genius and compete with the best minds in the ultimate showdown of knowledge, logic, and innovation. Dive into the world of technology, coding, and digital mastery, and prove you have what it takes to claim the champion's title!",
    "date": "February 7, 2025",
    "image": "bits and bytes.png",
    "convener": "DR.K. RAJA",
    "facultyCoordinator": "Ms.M.Sneha Priya",
    "studentCoordinator": "Kalaivizhi (6381328559), Guru Priya(9003290788)",
    "registrationFee": 100,
    "registrationLink": "intbot_2k25",
    "venue": "SRM University, Ramapuram, Chennai",
    "teamSize": "1-2",
    "about": "Join the ultimate test of technical knowledge and teamwork at the *Bits and Bytes Battle This thrilling quiz event challenges your computer science expertise and problem-solving skills in an engaging and competitive environment. With exciting tasks and fast-paced action, its your chance to shine, collaborate, and outsmart the competition. Gather your teammate, sharpen your skills, and take on the challenge to claim victory",
    "highlights": "Cash prizes for the best research papers, networking with renowned academics, and the chance to publish your work in a reputable journal.",
    "rules": [
      "Each team shall consist of two members. No solo entries will be permitted.",
      "Teams must remain consistent throughout all rounds of the event. No substitutions or changes to team composition will be allowed once the competition begins.",
      "Scoring criteria will be clearly communicated by the event organizers before each round.",
      "The highest-scoring teams from the preliminary round will proceed to the semi-finals.",
      "The finals teams must complete the assigned tasks before their competitors to earn the opportunity to answer questions and score points.",
      "All participants must comply with the rules and instructions provided by the event organizers."
    ]
  }
]
